# LinePatternElement Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinePatternElement Class
Members See Also
---
An element that represents a line pattern.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class LinePatternElement : Element
```

Visual Basic
---
```text
Public Class LinePatternElement _
	Inherits Element
```

Visual C++
---
```text
public ref class LinePatternElement : public Element
```

# Remarks
The LinePatternElement represents a line pattern in a project. It enables the user to retrieve, modify or create a line pattern in a project.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..LinePatternElement
# See Also
LinePatternElement Members
Autodesk.Revit.DB Namespace